// ____________________________ Домашнее задание______________________________

// _______________________________ Задание 1 ________________________________
// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1


// int num = new Random().Next(100,1000);
// Console.WriteLine(num);

// int num1 = num / 10;

// int result = num1 % 10; 

// Console.WriteLine(result);



// ___________________________ Задание 2________________________________

// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// Console.WriteLine("Введите число");
// int num = Convert.ToInt32(Console.ReadLine());

// if (num < 100)
// {
//     Console.WriteLine("Третьей цифры нет");
// }

// while (num > 1000)
// {
//     num = num / 10;
// }
// num = num % 10;
// Console.WriteLine(num);



// ___________________________Задание 3____________________________

// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет


// Console.WriteLine("Введите число");
// int num = Convert.ToInt32(Console.ReadLine());

// if (num > 7)
// {
//     Console.WriteLine("Такого дня нет");
//    return;
// }


// if ((num >= 1) && (num <= 5))
// {
//     Console.WriteLine("Нет");
// }
// else
// {
//     Console.WriteLine("Да");
// }

